from time import sleep
from random import randint

company_names = ["星辰科技有限公司", "海洋物流有限公司", "绿色能源发展有限公司", "瑞丰投资管理有限公司",
                "智慧城市网络科技有限公司", "神州旅游有限公司", "蓝天环保工程有限公司", "阳光农业科技有限公司",
                "和谐地产有限公司", "时代广告传媒有限公司", "飞龙航空服务有限公司", "美丽家园装饰工程有限公司",
                "金色年华养老服务有限公司", "欣欣向荣贸易有限公司", "神速快递有限公司", "甜蜜时光餐饮管理有限公司",
                "智慧医疗科技有限公司", "碧水蓝天环保工程有限公司", "优学派教育科技有限公司", "神州租车有限公司",
                "阳光保险有限公司", "美丽中国旅游发展有限公司", "和谐家居有限公司", "金色年华酒店管理有限公司",
                "欣欣向荣影视有限公司", "神速物流有限公司", "甜蜜时光烘焙有限公司", "智慧城市安防科技有限公司",
                "碧水蓝天园林工程有限公司", "优学派智能科技有限公司", "神州数码有限公司", "阳光能源有限公司",
                "美丽中国环保有限公司", "和谐地产投资有限公司", "金色年华教育科技有限公司", "欣欣向荣广告传媒有限公司",
                "神速航空服务有限公司", "甜蜜时光餐饮管理有限公司", "智慧城市网络科技有限公司", "碧水蓝天农业科技有限公司",
                "优学派影视有限公司", "神州租车有限公司", "阳光保险有限公司", "美丽家园装饰工程有限公司",
                "和谐家居有限公司", "金色年华养老服务有限公司", "欣欣向荣贸易有限公司", "神速快递有限公司",
                "甜蜜时光餐饮管理有限公司", "智慧医疗科技有限公司", "碧水蓝天环保工程有限公司", "优学派教育科技有限公司",
                "神州旅游有限公司", "阳光农业科技有限公司", "美丽中国旅游发展有限公司", "和谐地产有限公司",
                "金色年华酒店管理有限公司", "欣欣向荣影视有限公司", "神速物流有限公司", "甜蜜时光烘焙有限公司",
                "智慧城市安防科技有限公司", "碧水蓝天园林工程有限公司", "优学派智能科技有限公司", "神州数码有限公司",
                "阳光能源有限公司", "美丽中国环保有限公司", "和谐地产投资有限公司"
]

comapany_dollar = [8975, 4677, 4463, 5301, 5588, 4648, 7267, 8913, 7092, 6797, 4432, 3052, 5873, 8002, 4324, 9284, 3469, 5974, 8141, 4835, 5247, 3480, 5274, 3933, 9251, 7141, 7014, 5279, 3820, 9913, 3250, 3814, 7623, 8927, 8861, 7871, 9402, 3838, 8643, 5600, 3481, 7896, 6199, 3479, 4779, 6198, 9250, 6535, 7855, 9541, 6517, 7314, 3148, 3383, 6024, 4154, 3255, 4691, 5907, 3669, 5177, 7757, 8251, 8441, 5467, 5005, 7149, 7599, 5723, 4888, 9394, 5636, 3769, 8599, 4058, 3639, 9215, 3657, 4959, 6430, 7788, 6278, 5323, 7963, 7163, 5984, 9818, 3793, 4867, 9799, 4359, 9170, 4257, 4200, 4196, 9835, 3275, 4986, 6103, 7525]

CompanyNumber = []


comapany_Dict = dict(zip(company_names, comapany_dollar))
# print(comapany_Dict)
for i in range(len(company_names)):
    CompanyNumber.append(i)

for i in comapany_Dict:
    CompanyNumber.append(i)

Comapany_NUMBER_NAME_DICT = dict(zip(CompanyNumber, company_names))
